owhinata/stm32f746g-disco/port/guix/guix_display.c
static bool      cam_preview_active;   /* session armed (begin..end): store() ok  */
static bool      cam_visible;          /* camera screen on display (SHOW..HIDE):
                                          gates the toggle's corrective + skip so
                                          we never stamp camera pixels onto, or
                                          drop a forward-copy on, another screen  */
static uint16_t *cam_view_data;        /* cam_view_buf base (registered by begin) */
static bool      cam_buf_stale[2];     /* per LTDC buffer; invariant above        */

/* True if screen-space rect r lies fully inside the camera icon rect. */
static bool rect_in_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   >= (GX_VALUE)CAM_RECT_L &&
	       r->gx_rectangle_top    >= (GX_VALUE)CAM_RECT_T &&
	       r->gx_rectangle_right  <= (GX_VALUE)CAM_RECT_R &&
	       r->gx_rectangle_bottom <= (GX_VALUE)CAM_RECT_B;
}

/* True if screen-space clip rect r fully COVERS the camera icon rect. */
static bool rect_covers_cam(const GX_RECTANGLE *r)
{
	return r->gx_rectangle_left   <= (GX_VALUE)CAM_RECT_L &&
	       r->gx_rectangle_top    <= (GX_VALUE)CAM_RECT_T &&
	       r->gx_rectangle_right  >= (GX_VALUE)CAM_RECT_R &&
	       r->gx_rectangle_bottom >= (GX_VALUE)CAM_RECT_B;
}

/* Corrective copy of the full camera rect (cam_view_buf -> @p fb at the icon
   position).  Caller holds ltdc_lock.  Tries DMA2D first and, on the rare DMA2D
   failure, falls back to a row-by-row CPU copy so the presented camera rect is
   ALWAYS made current -- the toggle therefore never has to skip the flip (which
   would strand that cycle's non-camera draws).  Both buffers are MPU
   non-cacheable SDRAM, so the CPU copy is coherent with no cache maintenance.
   Returns 0 when the rect was refreshed, -1 only on a NULL buffer (cannot happen
   while cam_visible, since begin() set cam_view_data). */
static int cam_rect_refresh(uint16_t *fb)
{
	uint16_t *dst;
	const uint16_t *src;
	uint32_t y;

	if (fb == NULL || cam_view_data == NULL)
		return -1;
	dst = fb + (uint32_t)CAM_RECT_T * LTDC_LCD_WIDTH + CAM_RECT_L;
	if (guix_dma2d_blit(dst, cam_view_data, CAM_VIEW_W, CAM_VIEW_H,
	                    LTDC_LCD_WIDTH - CAM_VIEW_W, 0u) == 0)
		return 0;
	/* DMA2D failed.  guix_dma2d_blit aborts a timed-out transfer, so the engine
	   is normally idle now; only run the CPU copy once that is confirmed (START
	   clear).  If the abort itself failed the engine is wedged (hard DMA2D
	   fault) -- do NOT race it with a CPU write; report failure and leave the
	   buffer stale. */
	if ((DMA2D->CR & DMA2D_CR_START) != 0u)
		return -1;
	src = cam_view_data;
	for (y = 0; y < CAM_VIEW_H; y++) {
		memcpy(dst, src, (size_t)CAM_VIEW_W * sizeof(uint16_t));
		dst += LTDC_LCD_WIDTH;
		src += CAM_VIEW_W;
	}
	return 0;
}

/* Register the view buffer and arm B2 for a preview session.  Both LTDC buffers
   start stale so the first frames are corrected before present. */
void guix_display_cam_preview_begin(uint16_t *view_buf)
{
	ltdc_lock_frame();
	cam_view_data      = view_buf;
	cam_buf_stale[0]   = true;
	cam_buf_stale[1]   = true;
	cam_preview_active = true;
	ltdc_unlock_frame();
}

void guix_display_cam_preview_end(void)
{
	ltdc_lock_frame();
	cam_preview_active = false;
	cam_visible        = false;
	cam_view_data      = NULL;
	ltdc_unlock_frame();
}

/* Gate the buffer-toggle B2 paths to when the camera screen is actually on
   display (set by the SHOW/HIDE root events on the GUIX thread).  Turning it on
   marks both buffers stale so the first presented frame is corrected -- the
   camera rect currently holds whatever the previous screen drew there. */
void guix_display_cam_set_visible(bool on)
{
	ltdc_lock_frame();
	cam_visible = on;
	if (on) {
		cam_buf_stale[0] = true;
		cam_buf_stale[1] = true;
	}
	ltdc_unlock_frame();
}

/* Store a freshly captured frame into the view buffer and mark BOTH LTDC buffers
   stale, atomically under ltdc_lock (#59 B2).  Returns 0 on a completed DMA2D
   copy, -1 otherwise. */
int guix_display_cam_view_store(const uint16_t *src)
{
	int rc;

	ltdc_lock_frame();
	if (cam_view_data == NULL || !cam_preview_active) {
		ltdc_unlock_frame();
		return -1;
	}
	rc = guix_dma2d_blit(cam_view_data, src, CAM_VIEW_W, CAM_VIEW_H, 0u, 0u);
	if (rc == 0) {
		cam_buf_stale[0] = true;
		cam_buf_stale[1] = true;
	}
	ltdc_unlock_frame();
	return rc;
}

/*
 * Tear-free buffer toggle (GUIX calls this once per refreshed frame).  GUIX has
 * just composited the accumulated dirty region into the back buffer (= the
 * canvas memory).  Present it, repoint the canvas at the new back buffer, and
 * copy the dirty rectangle forward from the just-presented front into the new
 * back so BOTH buffers stay identical -- next frame GUIX again only redraws the
 * changed region on top of correct prior content.  Both buffers start cleared to
 * black (ltdc_init), so the "identical everywhere outside the running dirty
 * set" invariant holds from the first frame.
 */
static VOID guix_buffer_toggle(GX_CANVAS *canvas, GX_RECTANGLE *dirty)
{
	uint16_t *front, *back;
	INT x, y, right, bottom, w, h;

	ltdc_lock_frame();

	/* The canvas must be on the current back buffer; if not, ownership was
	   broken (should never happen behind ltdc_gui_take).  Be defensive: skip. */
	if ((uint16_t *)canvas->gx_canvas_memory != ltdc_back_buffer()) {
		LOG_WRN("buffer toggle: canvas not on back buffer, skipping flip");
		ltdc_unlock_frame();
		return;
	}

	/* #59 B2: ensure the buffer about to be presented holds the latest camera
	   frame BEFORE the flip.  In steady-state preview the full-rect pixelmap
	   draw already cleared this buffer's stale flag, so the corrective copy only
	   fires on a non-camera cycle whose camera rect has fallen behind. */
	if (cam_visible) {
		uint8_t cur = (uint8_t)!ltdc_active_buffer();

		/* Make the buffer about to be presented hold the latest camera frame.
		   cam_rect_refresh falls back to a CPU copy if DMA2D fails, so it
		   succeeds whenever the view buffer is valid; clear stale only then.  We
		   never skip the flip here -- doing so would strand this cycle's
		   non-camera draws in the back buffer, and the normal copy-forward below
		   keeps the two buffers consistent outside the camera rect (#59). */
		if (cam_buf_stale[cur] &&
		    cam_rect_refresh((uint16_t *)canvas->gx_canvas_memory) == 0)
			cam_buf_stale[cur] = false;
	}

	if (ltdc_gui_flip() != LTDC_OK || !ltdc_is_up()) {
		ltdc_unlock_frame();
		return;                       /* display faulted: leave it be */
	}

	/* Repoint the canvas at the freshly-freed back buffer. */
	back  = ltdc_back_buffer();
	front = ltdc_framebuffer();       /* what we just presented */
	canvas->gx_canvas_memory = (GX_COLOR *)back;

	/* #59 B2: when the live preview is on and the whole dirty region is the
	   camera icon, skip the copy-forward -- that rect is repainted from
	   cam_view_buf every frame and its two-buffer consistency is maintained by
	   the stale tracking above, so forwarding it is wasted bandwidth. */
	if (cam_visible && rect_in_cam(dirty)) {
		ltdc_unlock_frame();
		return;
	}

