owhinata/stm32f746g-disco/port/guix/guix_display.c
	/* Copy the dirty rectangle forward (front -> new back), clipped to panel. */
	x      = dirty->gx_rectangle_left;
	y      = dirty->gx_rectangle_top;
	right  = dirty->gx_rectangle_right;
	bottom = dirty->gx_rectangle_bottom;
	if (x < 0)
		x = 0;
	if (y < 0)
		y = 0;
	if (right > (INT)LTDC_LCD_WIDTH - 1)
		right = (INT)LTDC_LCD_WIDTH - 1;
	if (bottom > (INT)LTDC_LCD_HEIGHT - 1)
		bottom = (INT)LTDC_LCD_HEIGHT - 1;
	w = right - x + 1;
	h = bottom - y + 1;
	if (w > 0 && h > 0 && front != NULL && back != NULL) {
		uint32_t off = (uint32_t)y * LTDC_LCD_WIDTH + (uint32_t)x;

		guix_dma2d_blit(back + off, front + off, (uint32_t)w, (uint32_t)h,
		                LTDC_LCD_WIDTH - (uint32_t)w,
		                LTDC_LCD_WIDTH - (uint32_t)w);
	}

	ltdc_unlock_frame();
}

/*
 * DMA2D pixelmap draw (uncompressed, opaque RGB565 only).  GUIX pre-clips, so the
 * clip rectangle bounds the on-screen region; the source starts at the matching
 * offset inside the pixelmap.  Everything else (compressed, alpha-plane,
 * transparent, palette, ARGB formats, partial brush alpha, cacheable-SRAM
 * source) defers to the software 565rgb driver.  This is the path #56 uses to
 * blit camera frames (RGB565 in SDRAM). RM0385 §9.3.3 (M2M).
 */
static VOID guix_pixelmap_draw(GX_DRAW_CONTEXT *context, INT xpos, INT ypos,
                               GX_PIXELMAP *pmp)
{
	GX_RECTANGLE *clip = context->gx_draw_context_clip;
	INT pitch = context->gx_draw_context_pitch;
	INT w, h;

#if defined(GX_BRUSH_ALPHA_SUPPORT)
	if (context->gx_draw_context_brush.gx_brush_alpha != 0xffu) {
		sw_pixelmap_draw(context, xpos, ypos, pmp);
		return;
	}
#endif
	if (pmp->gx_pixelmap_format != GX_COLOR_FORMAT_565RGB ||
	    (pmp->gx_pixelmap_flags & (GX_PIXELMAP_COMPRESSED | GX_PIXELMAP_ALPHA |
	                               GX_PIXELMAP_TRANSPARENT)) ||
	    !guix_dma2d_src_ok(pmp->gx_pixelmap_data)) {
		sw_pixelmap_draw(context, xpos, ypos, pmp);
		return;
	}
	w = clip->gx_rectangle_right - clip->gx_rectangle_left + 1;
	h = clip->gx_rectangle_bottom - clip->gx_rectangle_top + 1;
	if (w <= 0 || h <= 0)
		return;
	{
		uint16_t *dst = (uint16_t *)context->gx_draw_context_memory +
		                (uint32_t)clip->gx_rectangle_top * (uint32_t)pitch +
		                (uint32_t)clip->gx_rectangle_left;
		const uint16_t *src = (const uint16_t *)pmp->gx_pixelmap_data +
		                (uint32_t)(clip->gx_rectangle_top - ypos) *
		                    (uint32_t)pmp->gx_pixelmap_width +
		                (uint32_t)(clip->gx_rectangle_left - xpos);
		uint32_t dst_off = (uint32_t)(pitch - w);
		uint32_t src_off = (uint32_t)(pmp->gx_pixelmap_width - w);

		/* #59 B2: the camera live-preview icon draws cam_view_buf into the back
		   buffer.  Keep the blit and the stale-flag clear in one ltdc_lock
		   section so the producer cannot advance cam_view_buf in between (a
		   false-negative would later present stale pixels).  Only a clip that
		   fully covers the icon rect counts as a complete repaint. */
		if (cam_preview_active &&
		    (uint16_t *)pmp->gx_pixelmap_data == cam_view_data) {
			ltdc_lock_frame();
			/* Clear the stale flag only when the copy actually COMPLETED and it
			   covered the whole icon rect -- otherwise the buffer's camera rect
			   is not really the latest view and must stay stale (#59). */
			if (guix_dma2d_blit(dst, src, (uint32_t)w, (uint32_t)h,
			                    dst_off, src_off) == 0 && rect_covers_cam(clip))
				cam_buf_stale[!ltdc_active_buffer()] = false;
			ltdc_unlock_frame();
		} else {
			(void)guix_dma2d_blit(dst, src, (uint32_t)w, (uint32_t)h,
			                      dst_off, src_off);
		}
	}
}

/*
 * DMA2D pixelmap blend.  Accelerates an opaque RGB565 image blended at a global
 * alpha (FG RGB565, replace-alpha = global) and an ARGB4444 image with per-pixel
 * alpha optionally scaled by the global alpha (combine-alpha).  565-with-separate-
 * alpha-plane, compressed, palette and cacheable-SRAM sources defer to software.
 * RM0385 §9.3.6 (blender) / §9.3.5 (alpha modes).
 */
static VOID guix_pixelmap_blend(GX_DRAW_CONTEXT *context, INT xpos, INT ypos,
                                GX_PIXELMAP *pmp, GX_UBYTE alpha)
{
	GX_RECTANGLE *clip = context->gx_draw_context_clip;
	INT pitch = context->gx_draw_context_pitch;
	uint32_t cmode, amode;
	INT w, h;

	if ((pmp->gx_pixelmap_flags & GX_PIXELMAP_COMPRESSED) ||
	    !guix_dma2d_src_ok(pmp->gx_pixelmap_data)) {
		sw_pixelmap_blend(context, xpos, ypos, pmp, alpha);
		return;
	}
	if (pmp->gx_pixelmap_format == GX_COLOR_FORMAT_565RGB &&
	    !(pmp->gx_pixelmap_flags & GX_PIXELMAP_ALPHA)) {
		cmode = DMA2D_INPUT_RGB565;
		amode = DMA2D_REPLACE_ALPHA;            /* whole image at global alpha */
	} else if (pmp->gx_pixelmap_format == GX_COLOR_FORMAT_4444ARGB) {
		cmode = DMA2D_INPUT_ARGB4444;
		amode = DMA2D_COMBINE_ALPHA;            /* per-pixel * global alpha     */
	} else {
		sw_pixelmap_blend(context, xpos, ypos, pmp, alpha);
		return;
	}
	w = clip->gx_rectangle_right - clip->gx_rectangle_left + 1;
	h = clip->gx_rectangle_bottom - clip->gx_rectangle_top + 1;
	if (w <= 0 || h <= 0)
		return;
	guix_dma2d_blend((uint16_t *)context->gx_draw_context_memory +
	                     (uint32_t)clip->gx_rectangle_top * (uint32_t)pitch +
	                     (uint32_t)clip->gx_rectangle_left,
	                 (const uint16_t *)pmp->gx_pixelmap_data +
	                     (uint32_t)(clip->gx_rectangle_top - ypos) *
	                         (uint32_t)pmp->gx_pixelmap_width +
	                     (uint32_t)(clip->gx_rectangle_left - xpos),
	                 (uint32_t)w, (uint32_t)h,
	                 (uint32_t)(pitch - w),
	                 (uint32_t)(pmp->gx_pixelmap_width - w),
	                 cmode, amode, alpha);
}

/*
 * NOTE on block move (intra-canvas scroll): GUIX's block move copies only the
 * still-valid portion of the block to the shifted position, and every non-empty
 * valid move overlaps source and destination within the one buffer.  DMA2D M2M
 * is not a memmove, so it cannot safely accelerate this -- the block move is left
 * on GUIX's direction-safe software 565rgb driver (not overridden).
 */

