owhinata/stm32f746g-disco/port/guix/guix_display.c
/*
 * DMA2D canvas copy / blend (multi-canvas compositing).  Mirrors the software
 * geometry: the source canvas, shifted by its display offset, is intersected
 * with the composite's dirty area and the overlap is copied (M2M) or blended at
 * the source canvas's global alpha (M2M_BLEND).  NOTE: a single managed visible
 * canvas (this firmware's design, gx_user.h) never composites canvases, so these
 * paths are not exercised here -- they are provided for completeness and any
 * future multi-canvas use.
 */
static VOID guix_canvas_copy(GX_CANVAS *canvas, GX_CANVAS *composite)
{
	GX_RECTANGLE dirty, overlap;
	INT w, h;

	/* DMA2D reads the source canvas and writes the composite; both must be in
	   coherent memory (non-cacheable SDRAM / read-only Flash).  A cacheable-SRAM
	   canvas defers to the software path. */
	if (!guix_dma2d_src_ok(canvas->gx_canvas_memory) ||
	    !guix_dma2d_src_ok(composite->gx_canvas_memory)) {
		sw_canvas_copy(canvas, composite);
		return;
	}
	dirty.gx_rectangle_left   = 0;
	dirty.gx_rectangle_top    = 0;
	dirty.gx_rectangle_right  = (GX_VALUE)(canvas->gx_canvas_x_resolution - 1);
	dirty.gx_rectangle_bottom = (GX_VALUE)(canvas->gx_canvas_y_resolution - 1);
	_gx_utility_rectangle_shift(&dirty, canvas->gx_canvas_display_offset_x,
	                            canvas->gx_canvas_display_offset_y);
	if (!_gx_utility_rectangle_overlap_detect(&dirty,
	                                          &composite->gx_canvas_dirty_area,
	                                          &overlap))
		return;
	w = overlap.gx_rectangle_right - overlap.gx_rectangle_left + 1;
	h = overlap.gx_rectangle_bottom - overlap.gx_rectangle_top + 1;
	guix_dma2d_blit((uint16_t *)composite->gx_canvas_memory +
	                    (uint32_t)overlap.gx_rectangle_top *
	                        (uint32_t)composite->gx_canvas_x_resolution +
	                    (uint32_t)overlap.gx_rectangle_left,
	                (const uint16_t *)canvas->gx_canvas_memory +
	                    (uint32_t)(overlap.gx_rectangle_top - dirty.gx_rectangle_top) *
	                        (uint32_t)canvas->gx_canvas_x_resolution +
	                    (uint32_t)(overlap.gx_rectangle_left - dirty.gx_rectangle_left),
	                (uint32_t)w, (uint32_t)h,
	                (uint32_t)(composite->gx_canvas_x_resolution - w),
	                (uint32_t)(canvas->gx_canvas_x_resolution - w));
}

static VOID guix_canvas_blend(GX_CANVAS *canvas, GX_CANVAS *composite)
{
	GX_RECTANGLE dirty, overlap;
	INT w, h;

	if (!guix_dma2d_src_ok(canvas->gx_canvas_memory) ||
	    !guix_dma2d_src_ok(composite->gx_canvas_memory)) {
		sw_canvas_blend(canvas, composite);
		return;
	}
	dirty.gx_rectangle_left   = 0;
	dirty.gx_rectangle_top    = 0;
	dirty.gx_rectangle_right  = (GX_VALUE)(canvas->gx_canvas_x_resolution - 1);
	dirty.gx_rectangle_bottom = (GX_VALUE)(canvas->gx_canvas_y_resolution - 1);
	_gx_utility_rectangle_shift(&dirty, canvas->gx_canvas_display_offset_x,
	                            canvas->gx_canvas_display_offset_y);
	if (!_gx_utility_rectangle_overlap_detect(&dirty,
	                                          &composite->gx_canvas_dirty_area,
	                                          &overlap))
		return;
	w = overlap.gx_rectangle_right - overlap.gx_rectangle_left + 1;
	h = overlap.gx_rectangle_bottom - overlap.gx_rectangle_top + 1;
	guix_dma2d_blend((uint16_t *)composite->gx_canvas_memory +
	                     (uint32_t)overlap.gx_rectangle_top *
	                         (uint32_t)composite->gx_canvas_x_resolution +
	                     (uint32_t)overlap.gx_rectangle_left,
	                 (const uint16_t *)canvas->gx_canvas_memory +
	                     (uint32_t)(overlap.gx_rectangle_top - dirty.gx_rectangle_top) *
	                         (uint32_t)canvas->gx_canvas_x_resolution +
	                     (uint32_t)(overlap.gx_rectangle_left - dirty.gx_rectangle_left),
	                 (uint32_t)w, (uint32_t)h,
	                 (uint32_t)(composite->gx_canvas_x_resolution - w),
	                 (uint32_t)(canvas->gx_canvas_x_resolution - w),
	                 DMA2D_INPUT_RGB565, DMA2D_REPLACE_ALPHA,
	                 canvas->gx_canvas_alpha);
}

UINT guix_display_driver_setup(GX_DISPLAY *display)
{
	/* Lay down GUIX's software 565rgb driver, binding our tear-free toggle. */
	_gx_display_driver_565rgb_setup(display, GX_NULL, guix_buffer_toggle);

	/* Save the software routines used as fallbacks for cases DMA2D cannot take. */
	sw_horizontal_line_draw = display->gx_display_driver_horizontal_line_draw;
	sw_pixelmap_draw        = display->gx_display_driver_pixelmap_draw;
	sw_pixelmap_blend       = display->gx_display_driver_pixelmap_blend;
	sw_canvas_copy          = display->gx_display_driver_canvas_copy;
	sw_canvas_blend         = display->gx_display_driver_canvas_blend;

	/* Install the DMA2D-accelerated overrides (#55 full DMA2D: solid fill,
	   pixelmap draw/blend, canvas copy/blend; the per-frame double-buffer
	   copy-forward is in guix_buffer_toggle).  block_move stays on the software
	   driver (intra-canvas moves overlap; DMA2D M2M is not a memmove). */
	display->gx_display_driver_horizontal_line_draw = guix_horizontal_line_draw;
	display->gx_display_driver_pixelmap_draw        = guix_pixelmap_draw;
	display->gx_display_driver_pixelmap_blend       = guix_pixelmap_blend;
	display->gx_display_driver_canvas_copy          = guix_canvas_copy;
	display->gx_display_driver_canvas_blend         = guix_canvas_blend;

	return GX_SUCCESS;
}
